{
    "values": [
        {
            "recordId": "a1",
            "data": {
                "text": "What if your job description were simply “Make tomorrow better?” That’s the essence of roles within our Bing Team. Every day, we bring an insatiable curiosity to the table, challenging ourselves to reimagine what is and what can be. We build on what’s come before to create what’s next. We drive machine intelligence. We help shape the future. We empower billions of people around the globe. Online Advertising is one of the fastest growing businesses on the Internet today, with about $70 billion of a $600 billion advertising market already online. Search engines, web publishers, major ad networks, and ad exchanges are now serving billions of ad impressions per day and generating terabytes of user events data every day. The rapid growth of online advertising has created enormous opportunities as well as technical challenges that demand computational intelligence. Computational Advertising has emerged as a new interdisciplinary field that involves information retrieval, machine learning, data mining, statistics, operations research, and micro-economics, to solve challenging problems that arise in online advertising. The central problem of computational advertising is to select an optimized slate of eligible ads for a user to maximize a total utility function that captures the expected revenue, user experience and return on investment for advertisers. Responsibilities Microsoft is innovating rapidly in this space to grow its share of this market by providing the advertising industry with the state-of-the-art online advertising platform and service. Bing Ads Marketplace and Serving (MPS) team is at the core of this effort, responsible for research & development of all the algorithmic components in our paid search advertising technology stack, including: • User/query intent understanding, document/ad understanding, user targeting • Relevance modeling, IR-based ad retrieval • User response (click & conversion) prediction using large scale machine learning algorithms • Marketplace mechanism design and optimization, and whole-page experience optimization • Rich and innovative Ad products that add relevant and personalized information • Network protection, fraud detection, traffic quality measurement • Advertising metrics and measurement, including relevance and ad campaign effectiveness • Data mining and analytics • Supply-demand forecasting • Ad campaign planning and optimization • Experimentation infrastructure including tools for configuring and launching experiments, dashboard, live marketplace monitoring, and diagnosis. We heavily use the recent advances in grid or cloud computing infrastructure to harness huge volume of data for solving many of the above mentioned problems. We love big data! The MPS team is a world-class R&D team of passionate and talented scientists and engineers who aspire to solve challenging problems and turn innovative ideas into high-quality products and services that can help hundreds of millions of users and advertisers, and directly impact our business. Our experimentation infrastructure allows us to innovate and test new algorithms rapidly with live traffic to measure their effectiveness, and launch them in production as soon as they produce positive results, which makes our work environment productive and rewarding. We are looking for an Applied Scientist or Machine Learning Scientist to incubate technologies from end to end to make product impact. The candidate will engage in high potential projects grounded in applications to improve our ad, query and web page understanding. Qualifications Skills & Qualifications:• Outstanding expertise and hands-on experience on machine learning, text analysis, data mining, and NLP• 3-5 years experience in software development• Knowledge of C#, C++, Java or Python• MS/PhD degree in CS/EE or related areas is preferred• Passionate, self-motivated• Effective communication skills, both verbal and written• Familiarity with distributed data processing/analysis and modeling paradigm, such as Map-Reduce and MPI is a plus Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form. Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.",
                "language": "en"
            }
        },
        {
            "recordId": "a2",
            "data": {
                "text": "Azure Machine Learning team is a fast-paced product group within the Microsoft Artificial Intelligence & Research organization. We are building the Machine Learning development platform that will make it easy for all data scientists and AI Developers to create and deploy robust, scalable and highly available machine learning solutions on the cloud, using the best of the open source ecosystem and innovation from inside the company and the latest breakthroughs in research We are looking for a Principal Program Manager who is passionate about delivering a highly available and reliable cloud platform that will transform the data science and machine learning experience. Come to build out and lead the Artificial Intelligence/Machine/Deep Learning investments, define innovative experiences for data science, and extend the state of the art in deep learning performance and efficiency in the industry. We are looking for a creative and technically minded product visionary with expertise in building and shipping large scale user experiences. A strong performer that can lead our UX efforts and drive cross-team initiatives to address major customer needs. Responsibilities In this role you will be responsible for leading the development of our Azure Machine Learning Web UX and drive our journey to modernize the appearance combining the different AML properties into one portal UX. You’ll help define the roadmap and the vision for our next generation of data science web experiences. You will be working closely with design and research counterparts to invent great data science experiences and lead the development team to deliver these modern experiences to our highly engaged customers. You will work with teams across the org to make this experience simple, reliable, fast and coherent with the other Microsoft AI products. Qualifications Have experience in building and leading teams and driving large cross team efforts.Have a track record in building and shipping products with an emphasis on UX.Are equally comfortable articulating the big picture and refining the small details.Are customer and data obsessed, always learning and refining your features to deliver maximum business impact. Have a BS Degree in Engineering, Computer Science, or similar degree. 7+ years of Product or Program Management experience. #AIPLATFORM##AIPLATREF# Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form. Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.",
                "language": "en"
            }
        }
    ]
}